Repository: NoopikxD/PromtTest
Catalog: CorpusSearch/CorpusSearch/en-ru.tmx
Source language: en
Languages: ru

source: For many months now, my new target has been - you. how is it that a baby with no extraordinary magical talent was able to defeat the greatest wizard of all time?
ru: - Я знал, что должен говорить с тобой, встретиться с тобой, если получится.

source: How did you escape with nothing but a scar while Lord Voldemort' s powers were destroyed?
ru: - Хагрид мой друг.

source: Why do you care how I escaped? _BAR_Voldemort was after your time......
ru: Только Дамбльдор считал его невиновным.

source: Voldemort is my past, present, and future
ru: Никто не погиб, даже кошка.

source: I AM LORD VOLDEMORT you you are the heir of Slytherin you are LORD VOLDEMORT so we... you didn' t think I was going to keep_BAR_my filthy Muggle father' s name? no
ru: Охота на Нечистокровных меня более не интересует.

source: I fashioned myself a new name a name I knew wizards everywhere would one day fear to speak, when I had become the greatest sorcerer in the world!
ru: Вот уже несколько месяцев, моей мишенью являешься ТЫ.

source: Albus Dumbledore is the greatest sorcerer in the world!
ru: Волдеморт был после тебя.

source: Dumbledore' s been driven out of this castle _BAR_by the mere memory of me! he would never be gone. not as long as those remain loyal to him
ru: Ты Волдеморт.

source: Fawkes?
ru: Нет.

source: so this is what Dumbledore sends his defender!
ru: - Альбус Дамбльдор величайший маг мира.

source: A songbird and an old hat!
ru: - Он не только не удрал.

source: Let' s match the powers of Lord Voldemort,
ru: Он ближе, чем ты думаешь.

source: Heir of Salazar Slytherin against the famous Harry Potter
ru: Попугая и драную шляпу.

source: so, I have asks, Potter, no one will save you
ru: Оно подчиняется только мне.

source: Potter, it only obeys me
ru: - Что ж...

source: no your bird may have blinded Basilisk but it can still hear you
ru: Твоя птица выцарапала глаза Василиску, но он все еще слышит тебя.

source: yes, Potter the process is nearly complete in a few minutes
ru: Увы тебе, Поттер.

source: Ginny Weasley will be dead and I will cease to be a memory
ru: Процесс почти завершен.

source: Lord Voldemort will return very much alive
ru: Лорд Волдеморт вернется...... живее всех живых.

source: Ginny
ru: - Дженни?

source: remarkable, isn' t it? how quickly the venom of Basilisk can penetrate the body
ru: Полагаю, тебе осталось жить не более минуты.

source: I guess you have a little more than a minute to live you will be with your dear mudblood mother, soon, Harry
ru: И ты встретишь свою любимую Нечистокровную мамочку, Гарри.

source: funny the damage a silly little book can do especially in the hands of a silly little girl what are you doing? stop no
ru: Эй, стой.

source: Harry it was me
ru: Гарри, ты ранен.

source: I swear
ru: Ну конечно.

source: I didn' t mean to
ru: Спасибо.

source: Riddle made me
ru: Все в порядке, Дженни.

source: Harry you are hurt
ru: Все прошло.

source: Don' t worry
ru: - Да, сэр.

source: Ginny you need to get yourself out follow the chamber, and you will find Ron
ru: - Есть серьезные основания, чтобы исключить вас.

source: you were briliant, Fawkes
ru: - Да, сэр.

source: I just wasn' t quick enough
ru: - Спасибо, сэр.

source: of course
ru: - Это всего лишь...

source: Phoenix tears have healing powers thanks it' s all right, Ginny it' s over it' s just memory amazing this is just like magic
ru: Да, ты можешь говорить на языке Заклинателей, Гарри.

source: you both realized, of course in the past few hours you' ve broken perhaps a dozen school rules yes, sir there are sufficient evidence to have you expelled yes, sir yes, sir therefore it is only fitting that you will both receive special awards _BAR_for services to the school
ru: Если я не ошибаюсь, Гарри...... он передал часть своей энергии тебе...... в ту ночь, когда ты получил этот шрам.

source: thanks, sir now, Mr. Weasley if you would have an hour to deliver this release paper to Azkaban
ru: - Не желая этого...... он сделал это.

source: I believe we want our gamekeeper back
ru: Мне место в Слитерине.

source: First, I want to thank you, Harry you must' ve shown me the real loyalty down the chamber nothing but that could have called Fawkes to you and second
ru: Ты владеешь многими способностями самого Волдеморта.

source: I sense that something is troubling you am I right, Harry? it' s just you see, sir, I couldn' t help but notice certain thing, certain certain similarities between Tom Riddle and me
ru: Решительностью, энергичностью...... и, позволь заметить, некоторым неуважением к правилам.

source: I see, well you can speak Parseltongue,?
ru: - Именно, Гарри.

source: Harry, why? because
ru: Именно.

source: Lord Voldemort can speak Parseltongue if I am not mistaken, Harry he transferred some of his powers to you _BAR_the night he gave you that scar.
ru: Что отличает тебя от Волдеморта.

source: Voldemort transferred some of his powers to me? not intentionally but yes so the sorting hat was right
ru: А наши поступки.

source: I should be in Slytherin it is true, Harry it was just many qualities Voldemort himself prizes determination, resourcefulness and if I may say so, _BAR_a certain disregard for rules, why then the sorting hat placed you in Gryffindor because I asked it to exactly, Harry,
ru: Осторожнее.

source: Exactly it makes you different from Voldemort it is not our abilities that show what we truly are it is our choices if you want proof why you belong to Gryffindor and I suggest you look more closely at this
ru: Значит это и есть твой хозяин.

source: Godric Gryffindor it' d take a true Gryffindor to pull out of that hat
ru: Ты служишь семье Малфоев.

source: Dobby, so, this is your master your family you serve is Malfoy' s
ru: С дороги, Поттер.

source: I will deal with you later
ru: Вы вернулись.

source: out of my way
ru: - Нелепо.

source: Potter so, it is true you have returned when the governors learned Arthur Weasley' s daughter_BAR_ was taken into Chamber, they saw fit to sending me back ridiculars curiously, Lucius
ru: - Как вы смеете!

source: Several among them are under the impression that you would curse their families if they didn' t want to agree to suspend me in the first place. how dare you? beg your pardon my sole concern has always been, and will always be the welfare of school and of course its students
ru: - Моим единственным намерением было и всегда будет...... процветание этого колледжа...... и, разумеется, его студентов.

source: the culprit has been identified
ru: - Волдеморт.

source: I would assume? oh, yes and who was it?
ru: - Понимаю.

source: Voldemort only this time he chosed to act through somebody else by means of this
ru: И если мы кое- кого поймаем на этом, то мы его...... больно накажем.

source: I see fortuanately our young Mr. Potter discovered it one hopes that no more _BAR_of Lord Voldemore' s old school things should find their way into innocent hands, the consequence for the one responsible would be severe well, let' s just hope that Mr. Potter will always be around to save the day don' t worry
ru: - Не беспокойтесь.

source: I will be
ru: Буду.

source: Dumbledore come Dobby, we leave here
ru: - Дамбльдор.

source: sir, I wonder if I could have that
ru: Идем, Добби.

source: Mr. Malfoy
ru: Мы уходим.

source: I have something of yours mine?
ru: - Мистер Малфой.

source: I don' t know what are you talking about
ru: - Мое?

source: I think you do, sir
ru: Не пойму, с чего ты это взял.

source: I think you slipped the diary to Ginny Weasley' s cauldron, that day in Diagon alley? do you?
ru: - Прекрасно понимаете, сэр.

source: why don' t you prove it?
ru: Идем, Добби.

source: come, Dobby open it
ru: - Открой его.

source: Dobby master has given Dobby a sock! what?
ru: - Добби.

source: I didn' t master has presented Dobby with cloth
ru: - Хозяин дал Добби носок.

source: Dobby is free
ru: - Что?

source: you lost me my servant!
ru: Ничего я не давал...

source: you shall not harm Harry Potter
ru: Добби свободен.

source: you parents would middle some fools too mark my words,
ru: - Ты не тронешь Гарри Поттера.

source: Potter one day soon, you are going to be the same, stick it
ru: Попомни мои слова, Поттер.

source: Harry Potter freed Dobby
ru: - Гарри Поттер освободил Добби.

source: How can dobby ever repay him? just promise me something anything Sir... never try to save my life again
ru: - Только пообещай мне кое- что.

source: welcome back, Sir Nicholus thank you good evening, sir Nicholus good evening good to see you, sir Nicholus thank you hello
ru: - Все, что угодно, сэр.

source: Hermione welcome back thanks sir Nicholus
ru: - Никогда больше не пытайся спасти меня.

source: Harry it' s Hermione
ru: - Спасибо.

source: eh.... eh... well! welcome back, Hermione it' s good to be back congratulations
ru: - Добрый вечер, сэр Николас.

source: I can' t believe you solved it well, we had loads of help from you we couldn' t have done it without you thanks could I have your attention please
ru: - Рад видеть вас, сэр Николас.

source: before we begin the feast
ru: - Спасибо.

source: let us have a round of applause for proffessor Sprout
ru: - Хермиона!

source: Madam Pomfrey whose mandrake juices' s been sowed successfully _BAR_and ministered to all who had been petrified
ru: С возвращением.

source: also, in the light of recent events as a school treat all exams have been cancelled
ru: - Спасибо, сэр Николас.

source: sorry
ru: - Гарри.

source: I am late
ru: Это Хермиона.

source: the owl that delivered my release papers got all lost and confused some bloody bird called Eroll
ru: - Поздравляю.

source: I, now, just ought to say that, _BAR_if it hasn' t been for you, Harry and Ron and Hermione, of course
ru: Не могу поверить, что вы решили эту загадку.

source: I would, I' il be still, you know, where...
ru: - Ты так нам помогла.

source: I just like to say, thanks
ru: - Спасибо.

source: it' s not Hogwarts without you, Hagrid
ru: - Хогвард невозможен без тебя, Хагрид.

source: Hyper Metal Sonic, the only thing left is to capture his essential life data.
ru: Осталось всего лишь переписать сущность твоего прототипа

source: Then you will be complete.
ru: И ты будешь завершён, мой Гипер Металсоник

source: When you awaken, it will be time!
ru: Когда ты проснёшься, настанет время!

source: Sonic!
ru: Соник!

source: It' s finally done!
ru: Я закончил!

source: See, isn' t it great?
ru: Смотри, правда здорово?

source: It' s a jet- propelled body board!
ru: Доска с электродвижком!

source: Come on, Sonic.
ru: Давай, Соник.

source: Don' t you want to try it too?
ru: Не хочешь тоже попробовать?

source: No thanks.
ru: Нет, спасибо.

source: All right, I' il try it myself!
ru: Ну ладно, испытаю её сам.

source: I guess Tails is still just a little kid.
ru: Тейлс как ребёнок, которому дали новую игрушку.

source: Come on, Sonic!
ru: Давай, Соник!

source: It' s okay if you can' t swim!
ru: Ничего страшного, что ты не умеешь плавать!

source: You should give it a try!
ru: Ты должен попробовать!

source: Just don' t get cocky and run into something.
ru: Ты главное смотри куда плывёшь, не врежься куда- нибудь!

source: I must be hearing things.
ru: Видимо показалось...

source: Wake up, Sonic!
ru: Проснись, Соник!

source: Shut up, Tails!
ru: Замолчи, Тейлс!!

source: Sonic.
ru: Соник...

source: Are you all right, Sonic?
ru: Ты в порядке, Соник?

source: I' m fine, but who was that?
ru: Да, всё нормально, а это КТО был?

source: Sonic, how have you been?
ru: У меня для тебя новость!

source: Oh no, not that old man again!
ru: О нет, только не этот старичок!

source: I' il pass on this one.
ru: Я пошёл отсюда...

source: Sonic, we' ve got to hurry up and do something!
ru: Соник, мы должны поторопиться и помочь ему!

source: You' re the one who can fly, why don' t you go do something?
ru: Между прочим, это ты умеешь летать, ты и помогай!

source: Sonic, you idiot!
ru: Идиот!

source: Fine, I can take care of this all by myself!
ru: Отлично, я и сам всё могу сделать!

source: Mister!
ru: Мистер!!!

source: Tails, it' s you!
ru: А, это ты, Тейлс?

source: It' s nice to see you again.
ru: Рад видеть тебя.

source: Mister, this isn' t the time to worry about that.
ru: У вас сейчас есть дело поважнее.

source: Your rocket' s on fire!
ru: Ваш самолёт горит!

source: No wonder it' s getting so warm in here!
ru: Неудивительно что вдруг стало так тепло!

source: Just hold on!
ru: Спокойно!

source: I' il fix it somehow!
ru: Сейчас попробую починить!

source: I' m not finished yet!
ru: Это еще не всё!

source: Hey, you' re pretty good at this, Tails!
ru: Очень впечатляет, Тейлс!

source: I got some practice in earlier on my body- board.
ru: Практиковался на доске для сёрфинга.

source: That' s amazing!
ru: Это потрясающе!

source: Mister, up ahead!
ru: Мистер!!

source: Thank you, Sonic!
ru: Спасибо, Соник!

source: Old man!
ru: Старичок!

source: Hey, old man!
ru: Слыш, старичок!

source: Old man, you should stop flying those dangerous things.
ru: Старик, тебе опасно летать на подобных машинках, может не стоит?

source: What are you talking about, Sonic?
ru: О чём ты говоришь, Соник?

source: I know I' m a little older now, but back in my heyday I won the Speed Races on Planet Freedom all the time.
ru: Я знаю, я немного постарел, но раньше я побеждал в каждой гонке на Планете Свободы.

source: Believe me, I was pretty popular with the ladies back then too.
ru: Поверь мне, к тому же я был очень популярен у девушек в то время.

source: Mister, didn' t you say you had some urgent business?
ru: Мистер, вы, кажется, сказали, что у вас очень важное дело, да?

source: Oh, right.
ru: О да!

source: It' s a real emergency.
ru: Очень важное!!

source: It' s the President.
ru: Президент!!

source: He wanted...
ru: Он хотел...

source: He wants us to come to the Presidential Palace right away?
ru: Он хотел, чтобы мы прямо сейчас направились к нему, так?

source: Right, that was it!
ru: Да, да, точно!

source: Please hurry!
ru: Поторопитесь!

source: Old man, you could have just called to tell us that.
ru: Знаешь, было бы проще, если бы ты просто позвонил и сказал нам это.

source: Oh, yeah, I guess I could' ve done that.
ru: Ээ, да, наверное, следовало так поступить.

source: Old man, take care of the place while we' re gone!
ru: Старичок, присмотри тут за всем, пока нас не будет!

source: I understand!
ru: Конечно, можете рассчитывать на меня!

source: Let' s go, Tails!
ru: Полетели, Тейлс!

source: Bon voyage!
ru: До встречи!

source: Mr. President, what' s the urgent business?
ru: Мистер Президент, в чём заключается то важное дело?

source: It' s been a long time, hasn' t it, Sonic, Tails.
ru: Давно не виделись, не так ли, Соник, Тейлс.

source: It' s Eggman!
ru: Доктор Роботник!

source: Please accept a small token of my gratitude for coming all this way.
ru: Пожалуйста, примите это в дар от меня за то, что проделали этот путь сюда.

source: That' s a funny way to show your gratitude.
ru: Интересные у тебя подарки.

source: Don' t do it, please!
ru: Соник, остановись!

source: Sonic, for the sake of my daughter and everyone else, listen to him!
ru: Соник, ради безопасности моей дочери и всех остальных, выслушай его!

source: That' s a dirty trick, Eggman.
ru: Грязный трюк, Роботник.

source: Eggman!
ru: Роботник!

source: You kidnaped them so you could take over South Island, didn' t you?
ru: Ты похитил Президента и его дочь и собираешься завладеть Южным островом, не так ли?

source: Do you think really think I would do something that underhanded?
ru: Вы что, правда думаете, что я могу пойти на такой ужасный поступок?

source: Listen, Sonic.
ru: Слушай меня, Соник.

source: This concerns all of Planet Freedom, so you' d better listen to everything I have to say.
ru: Дело касается всей Планеты Свободы, так что тебе лучше выслушать всё, что я собираюсь сказать.

source: Don' t you care what happens to pretty, young Sarah?
ru: Тебе не всё равно, что станет с хорошенькой молодой Сарой?

source: Help me, Papa!
ru: Папа, помоги мне!

source: Sonic, please listen to what Eggman has to say!
ru: Соник, пожалуйста, выслушай доктора Роботника!

source: Go ahead and talk, Eggman.
ru: В чём дело, Роботник?

source: Really, Sonic?
ru: Итак, Соник.

source: As both of you are aware, Planet Freedom is made up of two separate dimensions.
ru: Как вы оба знаете, на Планете Свободы существуют два разных мира.

source: The outer world, the one you live in, is known as the Land of the Sky.
ru: Внешний мир, в котором живёте вы, называется Небесные Земли

source: We already know all that.
ru: Скажи нам то, что мы не знаем.

source: Quiet!
ru: Молчать!

source: Just shut up!
ru: Тихо!

source: And the inner dimension is known as the Land of Darkness.
ru: И внутренний мир, известный как Тёмные Земли

source: I live peacefully in the inner dimension, where I have created a high- tech city called Eggmanland.
ru: Я жил там спокойно, во внутреннем мире, где я создал высокотехнологичный город - Роботрополис

source: Black Eggman.
ru: До тех пор, пока он, Тёмный Роботник, не появился из неоткуда!

source: I don' t know where he came from, but he attacked my city with a battalion of robots.
ru: Я не знаю, откуда он пришёл, но он напал на мой город с армией роботов.

source: Now, there is no place down there for me to live.
ru: Он полностью захватил нас, и изгнал меня из моего дома.

source: He jammed the Robot Generator, causing it to run wild.
ru: Затем, Тёмный Роботник нарушил работу мощнейшего электрогенератора, питающего весь город и вырабатывающего огромное количество электроэнергии!

source: According to my calculations, if the Robot Generator isn' t stopped by sunrise tomorrow, there will be a giant explosion!
ru: Судя по моим расчетам, если генератор не будет остановлен к завтрашнему закату, произойдёт мощнейший взрыв!

source: Fine!
ru: Отлично!

source: But don' t blame me when this happens!
ru: И не вините меня, когда это произойдёт!

source: What can we do to stop this, Eggman?
ru: Как мы можем предотвратить это, Роботник?

source: Then he has to get into Eggmanland and stop that generator!
ru: Кто- то должен пробраться через все ловушки Тёмного Роботника, затем пробраться в Роботрополис и отключить этот генератор!

source: And it' s the fastest one here that should do it!
ru: И это может сделать только самый быстрый, из находящихся здесь!

source: Forget about it.
ru: Забудь об этом.

source: You' re the one that created that stupid contraption in the first place.
ru: Это ты создал весь этот мир и этих роботов.

source: Why should I have to clean up after you?
ru: С какой стати я должен исправлять твои ошибки?

source: Please do it!
ru: Пожалуйста, сделай это!

source: South Island...
ru: Южный остров...

source: No, the entire planet is depending on you!
ru: Нет, планета целиком зависит от тебя!

source: Sonic, I don' t care what happens to Eggman or Papa, but please do this for both of us!
ru: Соник, мне всё равно, что произойдёт с Роботником или Папой, но, пожалуйста, сделай это для нас двоих!

source: When Eggman speaks, 99 times out of 100 he' s lying.
ru: Когда Роботник говорит что- то, то в 99 случаях из 100 он лжёт.

source: But what if this is that one other time?
ru: Но вдруг это тот самый один случай?

source: Fine, I' il do it.
ru: Хорошо, я сделаю это...

source: Sonic...
ru: Соник...

source: Tails, take this with you.
ru: Тейлс, тебе надо взять это с собой.

source: It' s a navigator.
ru: Это навигатор.

source: It will guide you to Eggmanland using the shortest route, as long as you keep it with you.
ru: Он отведёт вас в Роботрополис, самыми короткими путями.

source: Thank you, Eggman.
ru: Спасибо, Роботник.

source: Come on, Tails.
ru: Пойдём, Тейлс.

source: Tails, do you really trust that weird, little gadget that Eggman gave you?
ru: Тейлс, ты действительно доверяешь этой странной штуке, которую тебе дал Роботник?

source: Knowing him, he might' ve put a bomb in there.
ru: Зная его, можно предположить, что это бомба.

source: Eggman is the only one that knows how to get to Eggmanland.
ru: Только Роботник знает, как попасть в Роботрополис.

source: We don' t have any other choice but to trust this thing.
ru: Так что у нас нет выбора, придётся доверять этому навигатору.

source: Guess you' re right.
ru: Думаю, ты прав.

source: Even more importantly, I hope that the President and Sarah are all right.
ru: Надеюсь что с Президентом и Сарой всё в порядке.

source: No, no, no, I don' t like it when you win every time!
ru: Почему ты каждый раз побеждаешь?

source: All right, one more time!
ru: Ладно, еще раз!

source: Give up!
ru: Хватит, сдавайся!

source: We' ve played a hundred times!
ru: Мы уже переигрывали сотню раз!

source: I' il stop being your hostage.
ru: А я перестану быть твоей заложницей.

source: All right, we' il keep playing.
ru: Хорошо, давай заново.

source: No, no, no, you won again!
ru: Я ненавижу эту тупую игру!

source: I quit.
ru: Хорошо, достаточно.

source: I want to go for a drive.
ru: Я хочу покататься.

source: Absolutely not!
ru: Ни за что!

source: No, no!
ru: Нет, нет!

source: I want to go for a drive!
ru: Я хочу покататься!!

source: How did this get here?
ru: Что это?

source: You rock, Eggman!
ru: Это классно, Роботник!

source: I get to drive first!
ru: Я поведу первой.

source: Don' t touch that!
ru: Стой, Сара, не трогай тут ничего!

source: Don' t play with that!
ru: Не играй с кнопками!

source: Stop it, Sarah!
ru: Остановись, Сара!!!

source: No, stop that!
ru: Нет, остановитесь!

source: That must be the entrance to the Land of Darkness!
ru: Смотри, это должно быть вход в Тёмные Земли.

source: We' re getting some bad turbulence here, so hang on, Sonic!
ru: Здесь сильная турбулентность, мне сложно управлять самолётом.

source: All right, here we go!
ru: Держись, Соник!

source: Hang on, Sonic!
ru: Держись, Соник.

source: We' re almost out of here!
ru: Мы почти на месте!

source: Tails!
ru: Эй, Тейлс!

source: Tails, are you all right?
ru: Тейлс, ты цел?

source: I' m fine, but I' m worried about that tornado!
ru: Я в порядке, но Торнадо!

source: So this is the Land of Darkness!
ru: Тёмные Земли...

source: Eggmanland should be straight ahead!
ru: Навигатор показывает, что Роботрополис там!

source: Tails, doesn' t something seem a little strange?
ru: Тогда вперёд

source: I think Eggman purposely picked the route with the most traps!
ru: Мне кажется, Роботник специально выбрал для нас самый опасный путь!

source: But this really is the quickest way to the generator!
ru: Но это на самом деле самый короткий путь к генератору!

source: There' s even be a warp zone right up ahead!
ru: Впереди нас должны быть точка телепортации!

source: Let' s get moving!
ru: Вперёд!

source: What is this place?
ru: Что ты знаешь об этом месте?

source: It says these are ancient ruins.
ru: Судя по навигатору, мы телепортировались в место, обозначенное как Древние Руины.

source: Ancient ruins?
ru: Древние Руины?

source: These?
ru: Это??

source: I never knew the Land of Darkness had any of this.
ru: Никогда не думал, что Тёмные Земли выглядят так.

source: But Eggmanland is supposed to be really near.
ru: Но Роботрополис должен быть где- то рядом.

source: Let' s go somewhere high and see if we can see it from there.
ru: Давай заберёмся на какое- нибудь высокое место и посмотрим.

source: The ruins are sinking right into the ocean!
ru: Эти Руины затонули в океане.

source: Sonic, I bet it' s because the Robot Generator is out of control and causing reactions under the ground!
ru: Соник, я уверен, что всё это из- за того, что генератор вышел из под контроля, и создаёт подземные толчки.

source: Right!
ru: Правильно!

source: We should hurry!
ru: Мы должны поспешить!

source: I' m afraid of lightning!
ru: Аа, я боюсь молнии!!!
